---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.SystemClassification
source: html/b6c60ee8-b012-b506-dc42-a47c82ee9e7c.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.SystemClassification Property

The system classification of the duct fitting or duct accessory.

## Syntax (C#)
```csharp
public MEPSystemClassification SystemClassification { get; }
```